In [2]:
import pandas as pd

In [3]:
transaction = pd.read_csv('csv/transaction.csv', delimiter=';')
transaction.head()

,transaction_id,item_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,NaN,2,2950,25.02.2017,False,Approved,Solex,Standard,medium,medium,"71,49","53,62"
1,2,NaN,3,3120,21.05.2017,True,Approved,Trek Bicycles,Standard,medium,large,"2091,47","388,92"
2,3,NaN,37,402,16.10.2017,False,Approved,OHM Cycles,Standard,low,medium,"1793,43","248,82"
3,4,NaN,88,3135,31.08.2017,False,Approved,Norco Bicycles,Standard,medium,medium,"1198,46","381,10"
4,5,NaN,78,787,01.10.2017,True,Approved,Giant Bicycles,Standard,medium,large,"1765,3","709,48"

In [4]:
item = pd.read_csv('csv/item.csv', delimiter=';')
item.head()

,item_id,product_id,brand,product_line,product_class,product_size,standard_cost
0,0,0,Norco Bicycles,Road,medium,medium,"376,84"
1,1,0,Norco Bicycles,Standard,low,medium,"290,41"
2,2,0,OHM Cycles,Road,high,large,"7,21"
3,3,0,Trek Bicycles,Standard,medium,medium,"388,72"
4,4,0,OHM Cycles,Standard,medium,medium,"125,07"

In [5]:
item_columns = ['product_id', 'brand', 'product_line', 'product_class', 'product_size', 'standard_cost']
upd_trans = transaction.drop(columns='item_id')
upd_trans = upd_trans.merge(item, how='left', on=item_columns)

In [6]:
upd_trans.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,item_id
0,1,2,2950,25.02.2017,False,Approved,Solex,Standard,medium,medium,"71,49","53,62",30
1,2,3,3120,21.05.2017,True,Approved,Trek Bicycles,Standard,medium,large,"2091,47","388,92",32
2,3,37,402,16.10.2017,False,Approved,OHM Cycles,Standard,low,medium,"1793,43","248,82",94
3,4,88,3135,31.08.2017,False,Approved,Norco Bicycles,Standard,medium,medium,"1198,46","381,10",179
4,5,78,787,01.10.2017,True,Approved,Giant Bicycles,Standard,medium,large,"1765,3","709,48",161

In [7]:
# убираем уже не нужные столбцы, которые перенесли в таблицу item
upd_trans = upd_trans.drop(columns=item_columns)
# возвращаем столбец item_id на вторую позицию
upd_trans = upd_trans[['transaction_id', 'item_id', 'customer_id','transaction_date','online_order','order_status','list_price']] 
upd_trans.head()

,transaction_id,item_id,customer_id,transaction_date,online_order,order_status,list_price
0,1,30,2950,25.02.2017,False,Approved,"71,49"
1,2,32,3120,21.05.2017,True,Approved,"2091,47"
2,3,94,402,16.10.2017,False,Approved,"1793,43"
3,4,179,3135,31.08.2017,False,Approved,"1198,46"
4,5,161,787,01.10.2017,True,Approved,"1765,3"

In [9]:
# сохраняем обновленную таблицу транзакций в новый файл
upd_trans.to_csv('csv/upd_transaction.csv')